Title: Manipulating Strings  
Slug: manipulating_strings  
Summary: Manipulating Strings in SQL.   
Date: 2016-05-01 12:00  
Category: SQL  
Tags: Basics  
Authors: Chris Albon  

Note: This tutorial was written using [Catherine Devlin's SQL in Jupyter Notebooks library](https://github.com/catherinedevlin/ipython-sql). If you have not using a Jupyter Notebook, you can ignore the two lines of code below and any line containing `%%sql`. Furthermore, This tutorial uses SQLite's flavor of SQL, your version might have some differences in syntax.

For more, check out [Learning SQL](http://amzn.to/2jRriHj) by Alan Beaulieu.

In [25]:
# Ignore
%load_ext sql
%sql sqlite://
%config SqlMagic.feedback = False

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Create Data

In [26]:
%%sql

-- Create a table of criminals
CREATE TABLE criminals (pid, name, age, sex, city, minor);
INSERT INTO criminals VALUES (412, 'James Smith', 15, 'M', 'Santa Rosa', 1);
INSERT INTO criminals VALUES (234, 'Bill James', 22, 'M', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (632, 'Stacy Miller', 23, 'F', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (621, 'Betty Bob', NULL, 'F', 'Petaluma', 1);
INSERT INTO criminals VALUES (162, 'Jaden Ado', 49, 'M', NULL, 0);
INSERT INTO criminals VALUES (901, 'Gordon Ado', 32, 'F', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (512, 'Bill Byson', 21, 'M', 'Santa Rosa', 0);
INSERT INTO criminals VALUES (411, 'Bob Iton', NULL, 'M', 'San Francisco', 0);

(sqlite3.OperationalError) table criminals already exists [SQL: '-- Create a table of criminals\nCREATE TABLE criminals (pid, name, age, sex, city, minor);']

## Select A Subset Of A String

In [27]:
%%sql

-- Select the second to sixth character (i.e. four more charactrs) in the 'name' coumn
SELECT substr(name,2,4)

-- From the table 'criminals'
FROM criminals

[('ames',),
 ('ill ',),
 ('tacy',),
 ('etty',),
 ('aden',),
 ('ordo',),
 ('ill ',),
 ('ob I',)]

## Select Lower Case Version Of A String Column

In [28]:
%%sql

-- Select a lower case version of column 'name'
SELECT lower(name)

-- From the table 'criminals'
FROM criminals

[('james smith',),
 ('bill james',),
 ('stacy miller',),
 ('betty bob',),
 ('jaden ado',),
 ('gordon ado',),
 ('bill byson',),
 ('bob iton',)]

## Select Upper Case Version Of A String Column

In [29]:
%%sql

-- Select a upper case version of column 'name'
SELECT upper(name)

-- From the table 'criminals'
FROM criminals

[('JAMES SMITH',),
 ('BILL JAMES',),
 ('STACY MILLER',),
 ('BETTY BOB',),
 ('JADEN ADO',),
 ('GORDON ADO',),
 ('BILL BYSON',),
 ('BOB ITON',)]

## Select The Number Of Characters Of Each Value In A String Column

In [30]:
%%sql

-- Select a string length version of column 'name'
SELECT length(name)

-- From the table 'criminals'
FROM criminals

[(11,), (10,), (12,), (9,), (9,), (10,), (10,), (8,)]

## Select The Values In A String Column With Wrapped Quotes

In [31]:
%%sql

-- Select the values of the string column with wrapped quotes
SELECT quote(name)

-- From the table 'criminals'
FROM criminals

[("'James Smith'",),
 ("'Bill James'",),
 ("'Stacy Miller'",),
 ("'Betty Bob'",),
 ("'Jaden Ado'",),
 ("'Gordon Ado'",),
 ("'Bill Byson'",),
 ("'Bob Iton'",)]

## Replace Certain Values In A String Column

In [32]:
%%sql

-- Select values of a string column while replacing 'Ado' with 'Adonroni'
SELECT replace(name, 'Ado', 'Adonroni')

-- From the table 'criminals'
FROM criminals

[('James Smith',),
 ('Bill James',),
 ('Stacy Miller',),
 ('Betty Bob',),
 ('Jaden Adonroni',),
 ('Gordon Adonroni',),
 ('Bill Byson',),
 ('Bob Iton',)]